# VendorCode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..VendorCode Property
FabricationPart Class See Also
---
The vendor code of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string VendorCode { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VendorCode As String
	Get
```

Visual C++
---
```text
public:
property String^ VendorCode {
	String^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace